
// 1. Дан массив: [5.67, 3.21, 9.84, 2.34, 8.09, 1.23, 6.78, 4.56, 7.89, 0.45]
// Напиши функцию, который принимает массив чисел и округляет их по математическим правилам.
// Т.е результат  [6, 3, 10, 2, 8, 1, 7, 5, 8, 0]

const arr = [5.67, 3.21, 9.84, 2.34, 8.09, 1.23, 6.78, 4.56, 7.89, 0.45];

const roundNumbers = (arr) => arr.map(Math.round);


// 3. Оценить стоимость строки

const letterPrices = {
    'А': 1, 'Б': 3, 'В': 1, 'Г': 3, 'Д': 2, 'Е': 1, 'Ж': 5, 'З': 5, 'И': 1, 'Й': 4,
    'К': 2, 'Л': 2, 'М': 2, 'Н': 1, 'О': 1, 'П': 2, 'Р': 1, 'С': 1, 'Т': 1, 'У': 2,
    'Ф': 8, 'Х': 5, 'Ц': 5, 'Ч': 5, 'Ш': 8, 'Щ': 10, 'Ъ': 15, 'Ы': 4, 'Ь': 3, 'Э': 8,
    'Ю': 8, 'Я': 3
};

function stringCalc (str) {
    const uppercaseString = str.toUpperCase();
    let points = 0;

    for (const letter of uppercaseString) {
        if (letterPrices.hasOwnProperty(letter)) {
            points += letterPrices[letter]
        }
    }
    return points;
}

const word = 'собака';
const cost = stringCalc(word);

console.log(cost)

// 2. Повторим такую задачку. Сделай ее в двух вариантах.
// Первый с добавление глобальных функций, а второй используя обьект. Пример первого варианта:
// // Добавление студентов
// addStudent("Alice");
// addStudent("Bob");
// addStudent("Charlie");
//
// // Добавление оценок
// addGrade("Alice", 4.5);
// addGrade("Alice", 3.8);
// addGrade("Bob", 5.0);
// addGrade("Charlie", 4.2);
//
// // Получение среднего балла
// console.log(getAverageGrade("Alice")); // Ожидаемый результат: (4.5 + 3.8) / 2 = 4.15
// console.log(getAverageGrade("Bob"));   // Ожидаемый результат: 5.0 / 1 = 5.0
// console.log(getAverageGrade("Charlie")); // Ожидаемый результат: 4.2 / 1 = 4.2


function addGrade () {

}


function getAverageGrade () {

}

//   ^\+380[ ]?\(?[0-9]{3}\)?\s?[0-9]{3}[ -]?[0-9]{2}[ -]?[0-9]{2}$

// /[0-9]{1,2} (августа?|июн[ья]) [1-2][0-9]{3} год[ау]/gm

// str.split(/[1-2][0-9]{3} год[ау]/)

// 1.

// 1) Поиск номера телефона   \+[1-9] \([0-9]{3}\) [0-9]{3}-[0-9]{4}
// 2)  Поиск емейла [a-zA-Z._-0-9]+@[a-zA-Z]+.[a-zA-Z]{2,}
// 3) Поиск карточки  [0-9]{4}-?[0-9]{4}-?[0-9]{4}-?[0-9]{4}
// 4) Поиск ір адресса   [0-9]{3}\.[0-9]{3}\.[0-9]{3}\.[0-9]{3}
// 5) Поиск веб адреса  [https?:\/\/]+[www]{3}.[a-zA-Z]+.[a-zA-Z]{3}

// 2. С помощью js замени все номера карточки в тексте на "Х". Т.е хххх-хххх-хххх-хххх-хххх

let str = 'Привет, мой номер телефона: +1 (123) 456-7890, а мой email: user@example.com. Моя кредитная карта: 1234-5678-9012-3456 и еще одна: 5555-1234-5678-9999. Мой внутренний IP-адрес: 192.168.1.1, а внешний: 203.0.113.0. Не забудьте посетить мой веб-сайт: https://www.example.com.';
const regEx = /[0-9]{4}-[0-9]{4}-[0-9]{4}-[0-9]{4}/g;
const hideCardNumbers = str.replace(regEx, 'XXXX-XXXX-XXXX-XXXX');


const regEx2 = /[.!?]+/g;
const sentences = str.split(regEx2);